esphome/esphome/esphome/components/ethernet/ethernet_component_esp32.cpp
#include "ethernet_component.h"

#if defined(USE_ETHERNET) && defined(USE_ESP32)

#include "esphome/core/application.h"
#include "esphome/core/helpers.h"
#include "esphome/core/log.h"
#include "w5500_custom_spi.h"

#include <lwip/dns.h>
#include <cinttypes>
#include "esp_event.h"
#ifdef USE_PSRAM
#include <esp_heap_caps.h>
#include <cstring>
#endif

// IDF 6.0 moved per-chip PHY/MAC drivers to the Espressif Component Registry;
// they are no longer included via esp_eth.h and need explicit includes.
// On IDF 5.x these headers don't exist as standalone files.
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
#ifdef USE_ETHERNET_LAN8720
#include "esp_eth_phy_lan87xx.h"
#endif
#ifdef USE_ETHERNET_RTL8201
#include "esp_eth_phy_rtl8201.h"
#endif
#ifdef USE_ETHERNET_DP83848
#include "esp_eth_phy_dp83848.h"
#endif
#ifdef USE_ETHERNET_IP101
#include "esp_eth_phy_ip101.h"
#endif
#ifdef USE_ETHERNET_KSZ8081
#include "esp_eth_phy_ksz80xx.h"
#endif
#ifdef USE_ETHERNET_W5500
#include "esp_eth_mac_w5500.h"
#include "esp_eth_phy_w5500.h"
#endif
#ifdef USE_ETHERNET_DM9051
#include "esp_eth_mac_dm9051.h"
#include "esp_eth_phy_dm9051.h"
#endif
#endif  // ESP_IDF_VERSION >= 6.0.0

// LAN867x header exists on all IDF versions (external component since IDF 5.3)
#ifdef USE_ETHERNET_LAN8670
#include "esp_eth_phy_lan867x.h"
#endif

// ENC28J60 header exists on all IDF versions (always an external component)
#ifdef USE_ETHERNET_ENC28J60
#include "esp_eth_enc28j60.h"
#endif

// CH390 headers exist on all IDF versions (always an external component)
#ifdef USE_ETHERNET_CH390
#include "esp_eth_mac_ch390.h"
#include "esp_eth_phy_ch390.h"
#endif

#ifdef USE_ETHERNET_SPI
#include <driver/gpio.h>
#include <driver/spi_master.h>
#ifdef USE_SPI
#include "esphome/components/spi/spi.h"
#endif
#endif

namespace esphome::ethernet {

static const char *const TAG = "ethernet";

// PHY register size for hex logging
static constexpr size_t PHY_REG_SIZE = 2;

#ifdef USE_PSRAM
// ESP-IDF ethernet drivers malloc() every received frame in internal RAM, where it stays until lwIP
// hands it to the application. Move it to PSRAM; if that fails the frame is passed on where it is.
static esp_err_t eth_input_to_psram(esp_eth_handle_t handle, uint8_t *buffer, uint32_t length, void *priv) {
  auto *copy = static_cast<uint8_t *>(heap_caps_malloc(length, MALLOC_CAP_SPIRAM));
  if (copy != nullptr) {
    memcpy(copy, buffer, length);
    free(buffer);  // NOLINT(cppcoreguidelines-no-malloc) - allocated by the driver with malloc()
    buffer = copy;
  }
  return esp_netif_receive(static_cast<esp_netif_t *>(priv), buffer, length, nullptr);
}
#endif

void EthernetComponent::log_error_and_mark_failed_(esp_err_t err, const char *message) {
  ESP_LOGE(TAG, "%s: (%d) %s", message, err, esp_err_to_name(err));
  this->mark_failed();
}

#define ESPHL_ERROR_CHECK(err, message) \
  if ((err) != ESP_OK) { \
    this->log_error_and_mark_failed_(err, message); \
    return; \
  }

#define ESPHL_ERROR_CHECK_RET(err, message, ret) \
  if ((err) != ESP_OK) { \
    this->log_error_and_mark_failed_(err, message); \
    return ret; \
  }

void EthernetComponent::loop() {
  const uint32_t now = App.get_loop_component_start_time();

  switch (this->state_) {
    case EthernetComponentState::STOPPED:
      if (this->started_) {
        ESP_LOGI(TAG, "Starting connection");
        this->state_ = EthernetComponentState::CONNECTING;
        this->start_connect_();
      }
      break;
    case EthernetComponentState::CONNECTING:
      if (!this->started_) {
        ESP_LOGI(TAG, "Stopped connection");
        this->state_ = EthernetComponentState::STOPPED;
      } else if (this->connected_) {
        // connection established
        ESP_LOGI(TAG, "Connected");
        this->state_ = EthernetComponentState::CONNECTED;

        this->dump_connect_params_();
        this->status_clear_warning();
#ifdef USE_ETHERNET_CONNECT_TRIGGER
        this->connect_trigger_.trigger();
#endif
      } else if (now - this->connect_begin_ > 15000) {
        ESP_LOGW(TAG, "Connecting failed; reconnecting");
        this->start_connect_();
      }
      break;
    case EthernetComponentState::CONNECTED:
      if (!this->started_) {
        ESP_LOGI(TAG, "Stopped connection");
        this->state_ = EthernetComponentState::STOPPED;
#ifdef USE_ETHERNET_DISCONNECT_TRIGGER
        this->disconnect_trigger_.trigger();
#endif
      } else if (!this->connected_) {
        ESP_LOGW(TAG, "Connection lost; reconnecting");
        this->state_ = EthernetComponentState::CONNECTING;
        this->start_connect_();
#ifdef USE_ETHERNET_DISCONNECT_TRIGGER
        this->disconnect_trigger_.trigger();
#endif
      } else {
        this->finish_connect_();
        // When connected and stable, disable the loop to save CPU cycles
        this->disable_loop();
      }
      break;
  }
}

void EthernetComponent::setup() {
  if (esp_reset_reason() != ESP_RST_DEEPSLEEP) {
    // Delay here to allow power to stabilise before Ethernet is initialized.
    delay(300);  // NOLINT
  }

  if (this->enable_on_boot_) {
    this->ethernet_lazy_init_();
    if (!this->ethernet_initialized_) {
      // lazy_init bailed early via ESPHL_ERROR_CHECK or mark_failed; nothing more to do.
      return;
    }
    esp_err_t err = esp_eth_start(this->eth_handle_);
    ESPHL_ERROR_CHECK(err, "ETH start error");
  } else {
    ESP_LOGCONFIG(TAG, "Skipping init (enable_on_boot: false)");
    this->disabled_ = true;
  }
}

void EthernetComponent::ethernet_lazy_init_() {
  if (this->ethernet_initialized_)
    return;

  esp_err_t err;

#ifdef USE_ETHERNET_SPI
  // Install GPIO ISR handler to be able to service SPI Eth modules interrupts
  gpio_install_isr_service(0);

  spi_host_device_t host;
#ifdef USE_SPI
  if (this->spi_parent_ != nullptr) {
    // The bus is owned and already initialized by the spi component; share its host.
    host = this->spi_parent_->get_interface();
  } else
#endif
  {
    spi_bus_config_t buscfg = {
        .mosi_io_num = this->mosi_pin_,
        .miso_io_num = this->miso_pin_,
        .sclk_io_num = this->clk_pin_,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .data4_io_num = -1,
        .data5_io_num = -1,
        .data6_io_num = -1,
        .data7_io_num = -1,
        .max_transfer_sz = 0,
        .flags = 0,
        .intr_flags = 0,
    };

    host = this->interface_;

    err = spi_bus_initialize(host, &buscfg, SPI_DMA_CH_AUTO);
    ESPHL_ERROR_CHECK(err, "SPI bus initialize error");
  }
#endif
  // Network interface setup handled by network component

  esp_netif_config_t cfg = ESP_NETIF_DEFAULT_ETH();
  this->eth_netif_ = esp_netif_new(&cfg);

  // Init MAC and PHY configs to default
  eth_phy_config_t phy_config = ETH_PHY_DEFAULT_CONFIG();
  eth_mac_config_t mac_config = ETH_MAC_DEFAULT_CONFIG();

#ifdef USE_ETHERNET_SPI  // Configure SPI interface and Ethernet driver for specific SPI module
  spi_device_interface_config_t devcfg = {
      .command_bits = 0,
      .address_bits = 0,
      .dummy_bits = 0,
      .mode = 0,
      .duty_cycle_pos = 0,
      .cs_ena_pretrans = 0,
      .cs_ena_posttrans = 0,
      .clock_speed_hz = this->clock_speed_,
      .input_delay_ns = 0,
      .spics_io_num = this->cs_pin_,
      .flags = 0,
      .queue_size = 20,
      .pre_cb = nullptr,
      .post_cb = nullptr,
  };

#if defined(USE_ETHERNET_W5500)
  eth_w5500_config_t w5500_config = ETH_W5500_DEFAULT_CONFIG(host, &devcfg);
#elif defined(USE_ETHERNET_DM9051)
  eth_dm9051_config_t dm9051_config = ETH_DM9051_DEFAULT_CONFIG(host, &devcfg);
#elif defined(USE_ETHERNET_ENC28J60)
  eth_enc28j60_config_t enc28j60_config = ETH_ENC28J60_DEFAULT_CONFIG(host, &devcfg);
#elif defined(USE_ETHERNET_CH390)
  eth_ch390_config_t ch390_config = ETH_CH390_DEFAULT_CONFIG(host, &devcfg);
#endif

#if defined(USE_ETHERNET_W5500)
  w5500_config.int_gpio_num = this->interrupt_pin_;
#ifdef USE_ETHERNET_SPI_POLLING_SUPPORT
  w5500_config.poll_period_ms = this->polling_interval_;
#endif
  // Install the custom SPI driver that offloads the bulk RX/TX frame transfers off the busy-wait
  // path. w5500_config (and the devcfg it references) outlives esp_eth_mac_new_w5500() below, which
  // runs the driver's init().
  install_w5500_async_spi(w5500_config);
#elif defined(USE_ETHERNET_DM9051)
  dm9051_config.int_gpio_num = this->interrupt_pin_;
#ifdef USE_ETHERNET_SPI_POLLING_SUPPORT
  dm9051_config.poll_period_ms = this->polling_interval_;
#endif
#elif defined(USE_ETHERNET_ENC28J60)
  // ENC28J60 does not support poll_period_ms. CS must stay asserted for the chip's CS hold
  // time (t10, 210 ns) after the last clock or MAC/MII register reads fail ("wrong chip ID")
  enc28j60_config.spi_devcfg->cs_ena_posttrans = enc28j60_cal_spi_cs_hold_time((this->clock_speed_ + 999999) / 1000000);
  enc28j60_config.int_gpio_num = this->interrupt_pin_;
#elif defined(USE_ETHERNET_CH390)
  ch390_config.int_gpio_num = this->interrupt_pin_;
#ifdef USE_ETHERNET_SPI_POLLING_SUPPORT
  ch390_config.poll_period_ms = this->polling_interval_;
#endif
#endif

  phy_config.phy_addr = this->phy_addr_spi_;
  phy_config.reset_gpio_num = this->reset_pin_;

  esp_eth_mac_t *mac = nullptr;
#elif defined(USE_ETHERNET_OPENETH)
  esp_eth_mac_t *mac = esp_eth_mac_new_openeth(&mac_config);
#else
  phy_config.phy_addr = this->phy_addr_;
  phy_config.reset_gpio_num = this->power_pin_;

  eth_esp32_emac_config_t esp32_emac_config = eth_esp32_emac_default_config();
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
  esp32_emac_config.smi_gpio.mdc_num = this->mdc_pin_;
  esp32_emac_config.smi_gpio.mdio_num = this->mdio_pin_;
#else
  esp32_emac_config.smi_mdc_gpio_num = this->mdc_pin_;
  esp32_emac_config.smi_mdio_gpio_num = this->mdio_pin_;
#endif
  // The RGMII types (GENERIC, YT8531) use the RGMII interface and default GPIO map from
  // eth_esp32_emac_default_config(); writing the RMII clock config would clobber that
  // union, so skip the RMII clock override for them.
  if (this->type_ != ETHERNET_TYPE_GENERIC && this->type_ != ETHERNET_TYPE_YT8531) {
    esp32_emac_config.clock_config.rmii.clock_mode = this->clk_mode_;
    esp32_emac_config.clock_config.rmii.clock_gpio =
        static_cast<decltype(esp32_emac_config.clock_config.rmii.clock_gpio)>(this->clk_pin_);
  }

  esp_eth_mac_t *mac = esp_eth_mac_new_esp32(&esp32_emac_config, &mac_config);
#endif

  switch (this->type_) {
#ifdef USE_ETHERNET_OPENETH
    case ETHERNET_TYPE_OPENETH: {
      phy_config.autonego_timeout_ms = 1000;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
      this->phy_ = esp_eth_phy_new_generic(&phy_config);
#else
      this->phy_ = esp_eth_phy_new_dp83848(&phy_config);
#endif
      break;
    }
#endif
#if CONFIG_ETH_USE_ESP32_EMAC
#ifdef USE_ETHERNET_LAN8720
    case ETHERNET_TYPE_LAN8720: {
      this->phy_ = esp_eth_phy_new_lan87xx(&phy_config);
      break;
    }
#endif
#ifdef USE_ETHERNET_RTL8201
    case ETHERNET_TYPE_RTL8201: {
      this->phy_ = esp_eth_phy_new_rtl8201(&phy_config);
      break;
    }
#endif
#ifdef USE_ETHERNET_DP83848
    case ETHERNET_TYPE_DP83848: {
      this->phy_ = esp_eth_phy_new_dp83848(&phy_config);
      break;
    }
#endif
#ifdef USE_ETHERNET_IP101
    case ETHERNET_TYPE_IP101: {
      this->phy_ = esp_eth_phy_new_ip101(&phy_config);
      break;
    }
#endif
#ifdef USE_ETHERNET_JL1101
    case ETHERNET_TYPE_JL1101: {
      // PlatformIO (pioarduino): builtin esp_eth_phy_new_jl1101() on all IDF versions
      // Non-PlatformIO: custom ESPHome driver (esp_eth_phy_jl1101.c)
      this->phy_ = esp_eth_phy_new_jl1101(&phy_config);
      break;
    }
#endif
#ifdef USE_ETHERNET_KSZ8081
    case ETHERNET_TYPE_KSZ8081:
    case ETHERNET_TYPE_KSZ8081RNA: {
      this->phy_ = esp_eth_phy_new_ksz80xx(&phy_config);
      break;
    }
#endif
#ifdef USE_ETHERNET_LAN8670
    case ETHERNET_TYPE_LAN8670: {
      this->phy_ = esp_eth_phy_new_lan867x(&phy_config);
      break;
    }
#endif
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
    // GENERIC and YT8531 both use the built-in generic 802.3 PHY driver; YT8531 gets
    // extra chip-specific tuning applied later in ethernet_lazy_init_().
#ifdef USE_ETHERNET_GENERIC
    case ETHERNET_TYPE_GENERIC:
#endif
#ifdef USE_ETHERNET_YT8531
    case ETHERNET_TYPE_YT8531:
#endif
#if defined(USE_ETHERNET_GENERIC) || defined(USE_ETHERNET_YT8531)
      this->phy_ = esp_eth_phy_new_generic(&phy_config);
      break;
#endif
#endif
#endif
#ifdef USE_ETHERNET_SPI
#if defined(USE_ETHERNET_W5500)
    case ETHERNET_TYPE_W5500: {
      mac = esp_eth_mac_new_w5500(&w5500_config, &mac_config);
      this->phy_ = esp_eth_phy_new_w5500(&phy_config);
      break;
    }
#elif defined(USE_ETHERNET_DM9051)
    case ETHERNET_TYPE_DM9051: {
      mac = esp_eth_mac_new_dm9051(&dm9051_config, &mac_config);
      this->phy_ = esp_eth_phy_new_dm9051(&phy_config);
      break;
    }
#elif defined(USE_ETHERNET_ENC28J60)
    case ETHERNET_TYPE_ENC28J60: {
      mac = esp_eth_mac_new_enc28j60(&enc28j60_config, &mac_config);
      this->phy_ = esp_eth_phy_new_enc28j60(&phy_config);
      break;
    }
#elif defined(USE_ETHERNET_CH390)
    case ETHERNET_TYPE_CH390: {
      mac = esp_eth_mac_new_ch390(&ch390_config, &mac_config);
      this->phy_ = esp_eth_phy_new_ch390(&phy_config);
      break;
    }
#endif
#endif
    default: {
      this->mark_failed();
      return;
    }
  }

