esphome/esphome/esphome/components/ethernet/ethernet_component_esp32.cpp
  esp_eth_config_t eth_config = ETH_DEFAULT_CONFIG(mac, this->phy_);
  this->eth_handle_ = nullptr;
  err = esp_eth_driver_install(&eth_config, &this->eth_handle_);
  ESPHL_ERROR_CHECK(err, "ETH driver install error");

#ifndef USE_ETHERNET_SPI
#ifdef USE_ETHERNET_KSZ8081
  if (this->type_ == ETHERNET_TYPE_KSZ8081RNA && this->clk_mode_ == EMAC_CLK_OUT) {
    // KSZ8081RNA default is incorrect. It expects a 25MHz clock instead of the 50MHz we provide.
    this->ksz8081_set_clock_reference_(mac);
  }
#endif  // USE_ETHERNET_KSZ8081

  for (const auto &phy_register : this->phy_registers_) {
    this->write_phy_register_(mac, phy_register);
  }

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
#ifdef USE_ETHERNET_GENERIC
  // The generic 802.3 PHY driver only resets the PHY in its init; it never enables
  // auto-negotiation. A PHY that resets into a forced-speed mode (BMCR auto-nego bit
  // clear) therefore stays there, and esp_eth_start() skips negotiation because the
  // driver cached auto_nego_en=false at install time. Force auto-negotiation on here
  // (which also updates that cached state) so esp_eth_start() restarts a proper
  // negotiation. (YT8531 does this as part of its own chip-specific init below.)
  if (this->type_ == ETHERNET_TYPE_GENERIC) {
    bool autoneg_enable = true;
    err = esp_eth_ioctl(this->eth_handle_, ETH_CMD_S_AUTONEGO, &autoneg_enable);
    ESPHL_ERROR_CHECK(err, "Enable auto-negotiation failed");
  }
#endif
#ifdef USE_ETHERNET_YT8531
  if (this->type_ == ETHERNET_TYPE_YT8531) {
    this->yt8531_phy_init_();
    if (this->is_failed())
      return;
  }
#endif
#endif  // ESP_IDF_VERSION >= 6.0.0
#endif  // !USE_ETHERNET_SPI

  // use ESP internal eth mac
  uint8_t mac_addr[MAC_ADDRESS_SIZE];
  if (this->fixed_mac_.has_value()) {
    memcpy(mac_addr, this->fixed_mac_->data(), MAC_ADDRESS_SIZE);
  } else {
    esp_read_mac(mac_addr, ESP_MAC_ETH);
  }
  err = esp_eth_ioctl(this->eth_handle_, ETH_CMD_S_MAC_ADDR, mac_addr);
  ESPHL_ERROR_CHECK(err, "set mac address error");

  /* attach Ethernet driver to TCP/IP stack */
  err = esp_netif_attach(this->eth_netif_, esp_eth_new_netif_glue(this->eth_handle_));
  ESPHL_ERROR_CHECK(err, "ETH netif attach error");
#ifdef USE_PSRAM
  // Replaces the input path the glue installed during attach; its free function is a plain free()
  err = esp_eth_update_input_path(this->eth_handle_, eth_input_to_psram, this->eth_netif_);
  ESPHL_ERROR_CHECK(err, "ETH input path error");
#endif

  // Register user defined event handers
  err = esp_event_handler_register(ETH_EVENT, ESP_EVENT_ANY_ID, &EthernetComponent::eth_event_handler, nullptr);
  ESPHL_ERROR_CHECK(err, "ETH event handler register error");
  err = esp_event_handler_register(IP_EVENT, IP_EVENT_ETH_GOT_IP, &EthernetComponent::got_ip_event_handler, nullptr);
  ESPHL_ERROR_CHECK(err, "GOT IP event handler register error");
#if USE_NETWORK_IPV6
  err = esp_event_handler_register(IP_EVENT, IP_EVENT_GOT_IP6, &EthernetComponent::got_ip6_event_handler, nullptr);
  ESPHL_ERROR_CHECK(err, "GOT IPv6 event handler register error");
#endif /* USE_NETWORK_IPV6 */

  this->ethernet_initialized_ = true;
}

void EthernetComponent::enable() {
  if (!this->disabled_)
    return;

  ESP_LOGD(TAG, "Enabling");
  this->ethernet_lazy_init_();
  if (!this->ethernet_initialized_) {
    ESP_LOGE(TAG, "Cannot enable - init failed");
    return;
  }
  esp_err_t err = esp_eth_start(this->eth_handle_);
  if (err != ESP_OK) {
    ESP_LOGE(TAG, "esp_eth_start failed: %s", esp_err_to_name(err));
    return;
  }
  this->disabled_ = false;
  // The ETH_EVENT_START handler will set started_=true; the loop state machine
  // will then drive the STOPPED -> CONNECTING -> CONNECTED transitions.
  this->enable_loop();
}

void EthernetComponent::disable() {
  if (this->disabled_)
    return;

  ESP_LOGD(TAG, "Disabling");
  esp_err_t err = esp_eth_stop(this->eth_handle_);
  if (err != ESP_OK) {
    ESP_LOGW(TAG, "esp_eth_stop failed: %s — disabling anyway", esp_err_to_name(err));
  }
  this->disabled_ = true;
  // ETH_EVENT_STOP will clear started_; loop() will transition to STOPPED.
}

void EthernetComponent::dump_config() {
  const char *eth_type;
  switch (this->type_) {
#ifdef USE_ETHERNET_LAN8720
    case ETHERNET_TYPE_LAN8720:
      eth_type = "LAN8720";
      break;
#endif
#ifdef USE_ETHERNET_RTL8201
    case ETHERNET_TYPE_RTL8201:
      eth_type = "RTL8201";
      break;
#endif
#ifdef USE_ETHERNET_DP83848
    case ETHERNET_TYPE_DP83848:
      eth_type = "DP83848";
      break;
#endif
#ifdef USE_ETHERNET_IP101
    case ETHERNET_TYPE_IP101:
      eth_type = "IP101";
      break;
#endif
#ifdef USE_ETHERNET_JL1101
    case ETHERNET_TYPE_JL1101:
      eth_type = "JL1101";
      break;
#endif
#ifdef USE_ETHERNET_KSZ8081
    case ETHERNET_TYPE_KSZ8081:
      eth_type = "KSZ8081";
      break;

    case ETHERNET_TYPE_KSZ8081RNA:
      eth_type = "KSZ8081RNA";
      break;
#endif
#if defined(USE_ETHERNET_W5500)
    case ETHERNET_TYPE_W5500:
      eth_type = "W5500";
      break;
#elif defined(USE_ETHERNET_DM9051)
    case ETHERNET_TYPE_DM9051:
      eth_type = "DM9051";
      break;
#elif defined(USE_ETHERNET_ENC28J60)
    case ETHERNET_TYPE_ENC28J60:
      eth_type = "ENC28J60";
      break;
#elif defined(USE_ETHERNET_CH390)
    case ETHERNET_TYPE_CH390:
      eth_type = "CH390";
      break;
#endif
#ifdef USE_ETHERNET_OPENETH
    case ETHERNET_TYPE_OPENETH:
      eth_type = "OPENETH";
      break;
#endif
#ifdef USE_ETHERNET_LAN8670
    case ETHERNET_TYPE_LAN8670:
      eth_type = "LAN8670";
      break;
#endif
#ifdef USE_ETHERNET_GENERIC
    case ETHERNET_TYPE_GENERIC:
      eth_type = "Generic (RGMII)";
      break;
#endif
#ifdef USE_ETHERNET_YT8531
    case ETHERNET_TYPE_YT8531:
      eth_type = "YT8531 (RGMII)";
      break;
#endif

    default:
      eth_type = "Unknown";
      break;
  }

  ESP_LOGCONFIG(TAG,
                "Ethernet:\n"
                "  Connected: %s",
                YESNO(this->is_connected()));
  this->dump_connect_params_();
#ifdef USE_ETHERNET_SPI
#ifdef USE_SPI
  if (this->spi_parent_ != nullptr) {
    // Pins and interface come from the shared spi bus; only CS is ours.
    ESP_LOGCONFIG(TAG, "  CS Pin: %u", this->cs_pin_);
  } else
#endif
  {
    ESP_LOGCONFIG(TAG,
                  "  CLK Pin: %u\n"
                  "  MISO Pin: %u\n"
                  "  MOSI Pin: %u\n"
                  "  CS Pin: %u",
                  this->clk_pin_, this->miso_pin_, this->mosi_pin_, this->cs_pin_);
    const char *spi_interface = "spi3";
    if (this->interface_ == SPI2_HOST) {
      spi_interface = "spi2";
    }
    ESP_LOGCONFIG(TAG, "  Interface: %s", spi_interface);
  }
#ifdef USE_ETHERNET_SPI_POLLING_SUPPORT
  if (this->polling_interval_ != 0) {
    ESP_LOGCONFIG(TAG, "  Polling Interval: %" PRIu32 " ms", this->polling_interval_);
  } else
#endif
  {
    ESP_LOGCONFIG(TAG, "  IRQ Pin: %d", this->interrupt_pin_);
  }
  ESP_LOGCONFIG(TAG,
                "  Reset Pin: %d\n"
                "  Clock Speed: %d MHz",
                this->reset_pin_, this->clock_speed_ / 1000000);
#else
  if (this->power_pin_ != -1) {
    ESP_LOGCONFIG(TAG, "  Power Pin: %u", this->power_pin_);
  }
  ESP_LOGCONFIG(TAG,
                "  CLK Pin: %u\n"
                "  MDC Pin: %u\n"
                "  MDIO Pin: %u\n"
                "  PHY addr: %u",
                this->clk_pin_, this->mdc_pin_, this->mdio_pin_, this->phy_addr_);
#endif
  ESP_LOGCONFIG(TAG, "  Type: %s", eth_type);
}

