esphome/esphome/esphome/components/ethernet/ethernet_component_esp32.cpp
  ESP_LOGV(TAG, "DHCP Client Status: %d", status);

  err = esp_netif_dhcpc_stop(this->eth_netif_);
  if (err != ESP_ERR_ESP_NETIF_DHCP_ALREADY_STOPPED) {
    ESPHL_ERROR_CHECK(err, "DHCPC stop error");
  }

  err = esp_netif_set_ip_info(this->eth_netif_, &info);
  ESPHL_ERROR_CHECK(err, "DHCPC set IP info error");

#ifdef USE_ETHERNET_MANUAL_IP
  if (this->manual_ip_.has_value()) {
    // Set DNS through esp_netif so the servers are stored in the netif's own
    // dns[] array; raw dns_setserver() would be lost when the default-route
    // arbitration re-applies the default netif's DNS.
    // Log-only on failure: the link still has a working IP/gateway, so degraded
    // name resolution does not justify marking the whole component failed.
    esp_netif_dns_info_t dns{};
    if (this->manual_ip_->dns1.is_set()) {
      dns.ip = this->manual_ip_->dns1;
      err = esp_netif_set_dns_info(this->eth_netif_, ESP_NETIF_DNS_MAIN, &dns);
      if (err != ESP_OK) {
        ESP_LOGE(TAG, "Set main DNS failed: %s", esp_err_to_name(err));
      }
    }
    if (this->manual_ip_->dns2.is_set()) {
      dns.ip = this->manual_ip_->dns2;
      err = esp_netif_set_dns_info(this->eth_netif_, ESP_NETIF_DNS_BACKUP, &dns);
      if (err != ESP_OK) {
        ESP_LOGE(TAG, "Set backup DNS failed: %s", esp_err_to_name(err));
      }
    }
  } else
#endif
  {
    err = esp_netif_dhcpc_start(this->eth_netif_);
    if (err != ESP_ERR_ESP_NETIF_DHCP_ALREADY_STARTED) {
      ESPHL_ERROR_CHECK(err, "DHCPC start error");
    }
  }
#if USE_NETWORK_IPV6
  // Attempt to create IPv6 link-local address
  // We MUST attempt this here, not just in finish_connect_(), because with
  // min_ipv6_addr_count set, the component won't reach CONNECTED state without IPv6.
  // However, this may fail with ESP_FAIL if the interface is not up yet:
  // - At bootup when link isn't ready (#10281)
  // - After disconnection/cable unplugged (#10705)
  // We'll retry in finish_connect_() if it fails here.
  err = esp_netif_create_ip6_linklocal(this->eth_netif_);
  if (err != ESP_OK) {
    if (err == ESP_ERR_ESP_NETIF_INVALID_PARAMS) {
      // This is a programming error, not a transient failure
      ESPHL_ERROR_CHECK(err, "esp_netif_create_ip6_linklocal invalid parameters");
    } else {
      // ESP_FAIL means the interface isn't up yet
      // This is expected and non-fatal, happens in multiple scenarios:
      // - During reconnection after network interruptions (#10705)
      // - At bootup when the link isn't ready yet (#10281)
      // We'll retry once we reach CONNECTED state and the interface is up
      ESP_LOGW(TAG, "esp_netif_create_ip6_linklocal failed: %s", esp_err_to_name(err));
      // Don't mark component as failed - this is a transient error
    }
  }
#endif /* USE_NETWORK_IPV6 */

  this->connect_begin_ = millis();
  this->status_set_warning();
}

void EthernetComponent::dump_connect_params_() {
  if (!this->ethernet_initialized_) {
    ESP_LOGCONFIG(TAG, "  uninitialized/disabled");
    return;
  }
  esp_netif_ip_info_t ip;
  esp_netif_get_ip_info(this->eth_netif_, &ip);
  const ip_addr_t *dns_ip1;
  const ip_addr_t *dns_ip2;
  {
    LwIPLock lock;
    dns_ip1 = dns_getserver(0);
    dns_ip2 = dns_getserver(1);
  }

  // Use stack buffers for IP address formatting to avoid heap allocations
  char ip_buf[network::IP_ADDRESS_BUFFER_SIZE];
  char subnet_buf[network::IP_ADDRESS_BUFFER_SIZE];
  char gateway_buf[network::IP_ADDRESS_BUFFER_SIZE];
  char dns1_buf[network::IP_ADDRESS_BUFFER_SIZE];
  char dns2_buf[network::IP_ADDRESS_BUFFER_SIZE];
  char mac_buf[MAC_ADDRESS_PRETTY_BUFFER_SIZE];
  uint16_t link_speed = 10;
  switch (this->get_link_speed()) {
    case ETH_SPEED_100M:
      link_speed = 100;
      break;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 1, 0)
    case ETH_SPEED_1000M:
      link_speed = 1000;
      break;
#endif
    default:
      break;
  }
  ESP_LOGCONFIG(TAG,
                "  IP Address: %s\n"
                "  Hostname: '%s'\n"
                "  Subnet: %s\n"
                "  Gateway: %s\n"
                "  DNS1: %s\n"
                "  DNS2: %s\n"
                "  MAC Address: %s\n"
                "  Is Full Duplex: %s\n"
                "  Link Speed: %u",
                network::IPAddress(&ip.ip).str_to(ip_buf), App.get_name().c_str(),
                network::IPAddress(&ip.netmask).str_to(subnet_buf), network::IPAddress(&ip.gw).str_to(gateway_buf),
                network::IPAddress(dns_ip1).str_to(dns1_buf), network::IPAddress(dns_ip2).str_to(dns2_buf),
                this->get_eth_mac_address_pretty_into_buffer(mac_buf),
                YESNO(this->get_duplex_mode() == ETH_DUPLEX_FULL), link_speed);

#if USE_NETWORK_IPV6
  struct esp_ip6_addr if_ip6s[CONFIG_LWIP_IPV6_NUM_ADDRESSES];
  uint8_t count = 0;
  count = esp_netif_get_all_ip6(this->eth_netif_, if_ip6s);
  assert(count <= CONFIG_LWIP_IPV6_NUM_ADDRESSES);
  for (int i = 0; i < count; i++) {
    ESP_LOGCONFIG(TAG, "  IPv6: " IPV6STR, IPV62STR(if_ip6s[i]));
  }
#endif /* USE_NETWORK_IPV6 */
}

#ifndef USE_ETHERNET_SPI
void EthernetComponent::add_phy_register(PHYRegister register_value) { this->phy_registers_.push_back(register_value); }
#endif

void EthernetComponent::get_eth_mac_address_raw(uint8_t *mac) {
  if (!this->ethernet_initialized_) {
    // External callers (mdns, ethernet_info, etc.) may ask for the MAC before/regardless
    // of whether ethernet is enabled. Use the configured MAC if set, else the system ETH MAC.
    if (this->fixed_mac_.has_value()) {
      memcpy(mac, this->fixed_mac_->data(), MAC_ADDRESS_SIZE);
    } else {
      esp_read_mac(mac, ESP_MAC_ETH);
    }
    return;
  }
  esp_err_t err;
  err = esp_eth_ioctl(this->eth_handle_, ETH_CMD_G_MAC_ADDR, mac);
  ESPHL_ERROR_CHECK(err, "ETH_CMD_G_MAC error");
}

const char *EthernetComponent::get_eth_mac_address_pretty_into_buffer(
    std::span<char, MAC_ADDRESS_PRETTY_BUFFER_SIZE> buf) {
  uint8_t mac[MAC_ADDRESS_SIZE];
  get_eth_mac_address_raw(mac);
  format_mac_addr_upper(mac, buf.data());
  return buf.data();
}

